; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=255, out_folder=./training, instance_id=45, seed=2069, goal_proportion=0.03

(define (problem blocksworld-45)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 - object)
 (:init 
    (arm-empty)
    (clear b3)
    (on b3 b73)
    (on b73 b82)
    (on b82 b255)
    (on b255 b174)
    (on-table b174)
    (clear b167)
    (on-table b167)
    (clear b159)
    (on b159 b253)
    (on-table b253)
    (clear b49)
    (on b49 b5)
    (on b5 b137)
    (on b137 b254)
    (on b254 b161)
    (on b161 b191)
    (on b191 b138)
    (on b138 b77)
    (on b77 b184)
    (on b184 b148)
    (on b148 b228)
    (on b228 b242)
    (on-table b242)
    (clear b120)
    (on b120 b214)
    (on b214 b121)
    (on b121 b55)
    (on-table b55)
    (clear b177)
    (on b177 b250)
    (on b250 b119)
    (on b119 b162)
    (on b162 b252)
    (on-table b252)
    (clear b27)
    (on b27 b249)
    (on b249 b108)
    (on-table b108)
    (clear b205)
    (on b205 b176)
    (on b176 b186)
    (on b186 b81)
    (on b81 b95)
    (on b95 b2)
    (on b2 b156)
    (on-table b156)
    (clear b91)
    (on-table b91)
    (clear b145)
    (on b145 b209)
    (on b209 b32)
    (on-table b32)
    (clear b113)
    (on-table b113)
    (clear b94)
    (on b94 b127)
    (on b127 b165)
    (on b165 b169)
    (on b169 b142)
    (on b142 b89)
    (on b89 b199)
    (on b199 b227)
    (on-table b227)
    (clear b105)
    (on b105 b225)
    (on-table b225)
    (clear b84)
    (on b84 b149)
    (on b149 b193)
    (on b193 b1)
    (on b1 b155)
    (on b155 b16)
    (on b16 b187)
    (on b187 b211)
    (on b211 b104)
    (on b104 b69)
    (on b69 b172)
    (on-table b172)
    (clear b6)
    (on b6 b245)
    (on-table b245)
    (clear b51)
    (on b51 b160)
    (on b160 b236)
    (on b236 b147)
    (on b147 b128)
    (on b128 b21)
    (on b21 b170)
    (on b170 b75)
    (on b75 b208)
    (on b208 b207)
    (on b207 b131)
    (on b131 b164)
    (on-table b164)
    (clear b117)
    (on b117 b206)
    (on b206 b222)
    (on-table b222)
    (clear b218)
    (on-table b218)
    (clear b134)
    (on b134 b58)
    (on b58 b185)
    (on b185 b106)
    (on b106 b98)
    (on b98 b130)
    (on-table b130)
    (clear b243)
    (on b243 b212)
    (on b212 b152)
    (on b152 b226)
    (on b226 b43)
    (on b43 b92)
    (on b92 b143)
    (on b143 b182)
    (on b182 b189)
    (on-table b189)
    (clear b192)
    (on b192 b135)
    (on-table b135)
    (clear b107)
    (on b107 b158)
    (on b158 b223)
    (on-table b223)
    (clear b37)
    (on b37 b219)
    (on-table b219)
    (clear b18)
    (on b18 b133)
    (on b133 b231)
    (on b231 b150)
    (on-table b150)
    (clear b230)
    (on-table b230)
    (clear b116)
    (on b116 b210)
    (on b210 b213)
    (on-table b213)
    (clear b19)
    (on b19 b64)
    (on b64 b122)
    (on b122 b63)
    (on b63 b59)
    (on-table b59)
    (clear b78)
    (on b78 b115)
    (on b115 b168)
    (on-table b168)
    (clear b136)
    (on-table b136)
    (clear b12)
    (on b12 b179)
    (on b179 b46)
    (on b46 b83)
    (on b83 b8)
    (on b8 b11)
    (on b11 b163)
    (on b163 b198)
    (on b198 b99)
    (on-table b99)
    (clear b232)
    (on-table b232)
    (clear b38)
    (on b38 b50)
    (on b50 b124)
    (on b124 b42)
    (on b42 b247)
    (on b247 b31)
    (on-table b31)
    (clear b132)
    (on b132 b102)
    (on b102 b48)
    (on b48 b47)
    (on b47 b194)
    (on b194 b202)
    (on-table b202)
    (clear b181)
    (on b181 b56)
    (on b56 b103)
    (on-table b103)
    (clear b233)
    (on-table b233)
    (clear b111)
    (on b111 b10)
    (on-table b10)
    (clear b30)
    (on b30 b224)
    (on b224 b123)
    (on-table b123)
    (clear b90)
    (on b90 b54)
    (on-table b54)
    (clear b71)
    (on b71 b125)
    (on b125 b190)
    (on-table b190)
    (clear b100)
    (on b100 b239)
    (on b239 b153)
    (on-table b153)
    (clear b229)
    (on-table b229)
    (clear b166)
    (on-table b166)
    (clear b216)
    (on b216 b35)
    (on b35 b13)
    (on-table b13)
    (clear b80)
    (on b80 b204)
    (on-table b204)
    (clear b171)
    (on b171 b110)
    (on b110 b86)
    (on b86 b197)
    (on b197 b39)
    (on b39 b36)
    (on-table b36)
    (clear b200)
    (on-table b200)
    (clear b129)
    (on b129 b88)
    (on b88 b183)
    (on b183 b173)
    (on b173 b244)
    (on b244 b40)
    (on b40 b215)
    (on b215 b4)
    (on-table b4)
    (clear b14)
    (on b14 b248)
    (on b248 b146)
    (on-table b146)
    (clear b28)
    (on b28 b57)
    (on b57 b101)
    (on b101 b29)
    (on b29 b22)
    (on-table b22)
    (clear b85)
    (on b85 b66)
    (on b66 b44)
    (on b44 b240)
    (on b240 b23)
    (on-table b23)
    (clear b26)
    (on b26 b195)
    (on b195 b25)
    (on b25 b61)
    (on-table b61)
    (clear b74)
    (on b74 b45)
    (on-table b45)
    (clear b20)
    (on-table b20)
    (clear b96)
    (on-table b96)
    (clear b118)
    (on-table b118)
    (clear b234)
    (on-table b234)
    (clear b15)
    (on b15 b97)
    (on b97 b79)
    (on b79 b114)
    (on b114 b188)
    (on-table b188)
    (clear b246)
    (on-table b246)
    (clear b109)
    (on b109 b154)
    (on-table b154)
    (clear b53)
    (on b53 b220)
    (on-table b220)
    (clear b238)
    (on b238 b72)
    (on b72 b235)
    (on b235 b33)
    (on b33 b175)
    (on b175 b7)
    (on b7 b157)
    (on b157 b52)
    (on b52 b144)
    (on b144 b237)
    (on b237 b203)
    (on b203 b34)
    (on-table b34)
    (clear b126)
    (on b126 b65)
    (on-table b65)
    (clear b112)
    (on-table b112)
    (clear b251)
    (on-table b251)
    (clear b9)
    (on b9 b17)
    (on b17 b68)
    (on-table b68)
    (clear b41)
    (on-table b41)
    (clear b201)
    (on-table b201)
    (clear b180)
    (on-table b180)
    (clear b141)
    (on b141 b62)
    (on b62 b140)
    (on b140 b87)
    (on b87 b60)
    (on b60 b151)
    (on b151 b24)
    (on b24 b196)
    (on-table b196)
    (clear b70)
    (on b70 b76)
    (on-table b76)
    (clear b241)
    (on b241 b217)
    (on b217 b139)
    (on b139 b67)
    (on b67 b221)
    (on-table b221)
    (clear b178)
    (on-table b178)
    (clear b93)
    (on-table b93))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b2)
    (on b2 b3)
    (on-table b3)
    (clear b5)
    (on-table b5)
    (clear b6)
    (on-table b6)
    (clear b4)
    (on-table b4)
    (clear b7)
    (on-table b7))))

; plan
1. (unstack b3 b73)
   deleted: (on b3 b73) (clear b3) (arm-empty)
   added: (holding b3) (clear b73)
   goals met: 2 of 13
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 13
3. (unstack b6 b245)
   deleted: (on b6 b245) (clear b6) (arm-empty)
   added: (holding b6) (clear b245)
   goals met: 2 of 13
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 4 of 13
5. (unstack b129 b88)
   deleted: (on b129 b88) (clear b129) (arm-empty)
   added: (holding b129) (clear b88)
   goals met: 4 of 13
6. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 4 of 13
7. (unstack b205 b176)
   deleted: (on b205 b176) (clear b205) (arm-empty)
   added: (holding b205) (clear b176)
   goals met: 4 of 13
8. (putdown b205)
   deleted: (holding b205)
   added: (clear b205) (arm-empty) (on-table b205)
   goals met: 4 of 13
9. (unstack b176 b186)
   deleted: (on b176 b186) (clear b176) (arm-empty)
   added: (holding b176) (clear b186)
   goals met: 4 of 13
10. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 4 of 13
11. (unstack b186 b81)
   deleted: (on b186 b81) (clear b186) (arm-empty)
   added: (holding b186) (clear b81)
   goals met: 4 of 13
12. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 4 of 13
13. (unstack b238 b72)
   deleted: (on b238 b72) (clear b238) (arm-empty)
   added: (holding b238) (clear b72)
   goals met: 4 of 13
14. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 4 of 13
15. (unstack b49 b5)
   deleted: (on b49 b5) (clear b49) (arm-empty)
   added: (holding b49) (clear b5)
   goals met: 5 of 13
16. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 5 of 13
17. (unstack b5 b137)
   deleted: (on b5 b137) (clear b5) (arm-empty)
   added: (holding b5) (clear b137)
   goals met: 4 of 13
18. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 13
19. (unstack b72 b235)
   deleted: (on b72 b235) (clear b72) (arm-empty)
   added: (holding b72) (clear b235)
   goals met: 6 of 13
20. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 6 of 13
21. (unstack b235 b33)
   deleted: (on b235 b33) (clear b235) (arm-empty)
   added: (holding b235) (clear b33)
   goals met: 6 of 13
22. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 6 of 13
23. (unstack b33 b175)
   deleted: (on b33 b175) (clear b33) (arm-empty)
   added: (holding b33) (clear b175)
   goals met: 6 of 13
24. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 6 of 13
25. (unstack b175 b7)
   deleted: (on b175 b7) (clear b175) (arm-empty)
   added: (holding b175) (clear b7)
   goals met: 7 of 13
26. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 7 of 13
27. (unstack b7 b157)
   deleted: (on b7 b157) (clear b7) (arm-empty)
   added: (holding b7) (clear b157)
   goals met: 6 of 13
28. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 13
29. (unstack b81 b95)
   deleted: (on b81 b95) (clear b81) (arm-empty)
   added: (holding b81) (clear b95)
   goals met: 8 of 13
30. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 8 of 13
31. (unstack b84 b149)
   deleted: (on b84 b149) (clear b84) (arm-empty)
   added: (holding b84) (clear b149)
   goals met: 8 of 13
32. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 8 of 13
33. (unstack b149 b193)
   deleted: (on b149 b193) (clear b149) (arm-empty)
   added: (holding b149) (clear b193)
   goals met: 8 of 13
34. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 8 of 13
35. (unstack b193 b1)
   deleted: (on b193 b1) (clear b193) (arm-empty)
   added: (holding b193) (clear b1)
   goals met: 9 of 13
36. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 9 of 13
37. (unstack b1 b155)
   deleted: (on b1 b155) (clear b1) (arm-empty)
   added: (holding b1) (clear b155)
   goals met: 8 of 13
38. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 10 of 13
39. (unstack b88 b183)
   deleted: (on b88 b183) (clear b88) (arm-empty)
   added: (holding b88) (clear b183)
   goals met: 10 of 13
40. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 10 of 13
41. (unstack b183 b173)
   deleted: (on b183 b173) (clear b183) (arm-empty)
   added: (holding b183) (clear b173)
   goals met: 10 of 13
42. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 10 of 13
43. (unstack b173 b244)
   deleted: (on b173 b244) (clear b173) (arm-empty)
   added: (holding b173) (clear b244)
   goals met: 10 of 13
44. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 10 of 13
45. (unstack b244 b40)
   deleted: (on b244 b40) (clear b244) (arm-empty)
   added: (holding b244) (clear b40)
   goals met: 10 of 13
46. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 10 of 13
47. (unstack b40 b215)
   deleted: (on b40 b215) (clear b40) (arm-empty)
   added: (holding b40) (clear b215)
   goals met: 10 of 13
48. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 10 of 13
49. (unstack b215 b4)
   deleted: (on b215 b4) (clear b215) (arm-empty)
   added: (holding b215) (clear b4)
   goals met: 11 of 13
50. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 11 of 13
51. (unstack b95 b2)
   deleted: (on b95 b2) (clear b95) (arm-empty)
   added: (holding b95) (clear b2)
   goals met: 12 of 13
52. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 12 of 13
53. (unstack b2 b156)
   deleted: (on b2 b156) (clear b2) (arm-empty)
   added: (holding b2) (clear b156)
   goals met: 11 of 13
54. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 13 of 13
